import "../Home/home.scss"
import "../../styles/media.scss"
import {Swiper, SwiperSlide} from "swiper/react";
import 'swiper/css';
import 'swiper/css/navigation';
import React from "react";
import Footer from "../../components/Footer/index.jsx";
import Header from "../../components/Header/index.jsx";
import FLoors from "../../components/Floors/index.jsx"

import Brokers from "../../components/Brokers/index.jsx";
import Area from "../../components/Area/index.jsx"
import Projects from "../../components/Porjects/index.jsx"


const Home = () => {
    const articlesData = [
        {
            type: "Airport",
            name: "Аеропорт Малага",
            imageSrc: "/infrastructure/inf1.png",
            timeToReach: "50 минут"
        },
        {
            type: "School",
            name: "Школа Марбелья",
            imageSrc: "/infrastructure/inf2.png",
            timeToReach: "10 минут"
        },
        {
            type: "Golf Club",
            name: "Golf Club",
            imageSrc: "/infrastructure/inf3.png",
            timeToReach: "5 минут"
        },
        {
            type: "Shopping Mall",
            name: "Shopping Mall",
            imageSrc: "/infrastructure/inf4.png",
            timeToReach: "17 минут"
        }
    ];

    return (<>
        <Header/>

        <section className="banner">
            <div className="banner__bg">
                <div className="banner__info">
                    <h1>Villa Zafiro</h1>
                    <h4>Epitome of modern luxury and innovation, born from an exclusive the Lamborghini
                        collaboration</h4>
                    <div className="banner__prices">
                        <div className="banner__price">
                            <div>from<span>863 m2</span></div>
                            <div>property size</div>
                        </div>
                        <div className="banner__price">
                            <div>from <span>4,800,000 m2</span></div>
                            <div>property size</div>
                        </div>
                    </div>
                </div>

                <div className="banner__full">
                    <div className="banner__image">
                        <img src="/banner-photo.png" alt=""/>
                    </div>
                    <div className="banner__buttons">
                        <h4>Получите полную информацию о Villa Zafiro в Costa de Sol, Испания</h4>
                        <a href="" className="banner__presentation">Получить презентацию</a>
                        <a href="" className="banner__contact">Связаться</a>
                    </div>
                </div>
            </div>
        </section>

        <section className="exterior">
            <div className="exterior__title">Экстерьер</div>

            <div className="exterior__slider">
                <Swiper
                    slidesPerView={'auto'}
                    spaceBetween={'20'}
                    className="mySwiper"
                >
                    <SwiperSlide>
                        <img src="/slider/slide1.png" alt=""/>
                    </SwiperSlide>
                    <SwiperSlide>
                        <img src="/slider/slide2.png" alt=""/>
                    </SwiperSlide>
                    <SwiperSlide>
                        <img src="/slider/slide3.png" alt=""/>
                    </SwiperSlide>
                </Swiper>
            </div>
        </section>

        <FLoors/>

        <section className="selection">
            <div className="selection-block">
                <div className="selection-block__info">
                    <div className="selection-block__title">
                        <h3>
                            Подборка проектов для получения ВНЖ в Испании
                        </h3>
                    </div>

                    <a className="selection-block__button">
                        Скачать подборку
                    </a>
                </div>
                <img src="/banner-photo.png"/>
            </div>
            <div className="selection-block">
                <div className="selection-block__info">
                    <div className="selection-block__title">
                        <h3>
                            Подборка проектов для получения ВНЖ в Испании
                        </h3>
                    </div>

                    <a className="selection-block__button">
                    Посмотреть проекты
                    </a>
                </div>
                <img src="/banner-photo.png"/>
            </div>
        </section>

        <Brokers/>

        <section className="infrastructure">
            <div className="infrastructure__title">
                <h3>
                    Инфраструктура <br/>
                    вокруг виллы
                </h3>
            </div>

            <div className="infrastructure__infrastructures-blocks">
                {
                    articlesData.map((data, index) => (
                        <article key={data.name} className="infrastructures-block">
                            <img src={`${data.imageSrc}`} alt=""/>
                            <div className="infrastructures-block__info">
                                <div>
                                    {data.name}
                                </div>
                                <div>
                                    {
                                        index !== 2 ? <svg xmlns="http://www.w3.org/2000/svg" width="19" height="19"
                                                           viewBox="0 0 19 19"
                                                           fill="none">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                  d="M4.16973 6.50242C4.7633 4.99667 5.47729 3.95801 7.09359 3.95801H11.4261C13.0409 3.95801 13.7557 4.99667 14.35 6.50242L14.9435 8.11347C15.3859 8.11893 15.7921 8.3645 16.011 8.75867C16.1398 8.98319 16.2073 9.23914 16.2063 9.49967V11.577C16.2121 12.0621 15.9733 12.5158 15.575 12.7772C15.3855 12.8982 15.1668 12.9623 14.9435 12.9624H3.57539C3.35218 12.9623 3.13346 12.8982 2.944 12.7772C2.54557 12.5158 2.30685 12.0621 2.3126 11.577V9.49967C2.31176 9.23945 2.37922 8.98375 2.50788 8.75947C2.72681 8.3653 3.13311 8.11972 3.57539 8.11426L4.16973 6.50242Z"
                                                  stroke="#F1F1F1" stroke-linecap="round" stroke-linejoin="round"/>
                                            <path
                                                d="M5.43455 12.964C5.43455 12.6361 5.16873 12.6671 4.8408 12.6671C4.51288 12.6671 4.24705 12.6361 4.24705 12.964H5.43455ZM4.8408 14.0035H4.24705C4.24705 14.0096 4.24715 14.0158 4.24734 14.022L4.8408 14.0035ZM3.89294 15.0421L3.87172 15.6355C3.88571 15.636 3.89971 15.636 3.91369 15.6356L3.89294 15.0421ZM2.94585 14.0027L3.53929 14.0217C3.5395 14.0153 3.5396 14.009 3.5396 14.0027H2.94585ZM3.5396 12.778C3.5396 12.45 3.09696 12.6671 2.76904 12.6671C2.44112 12.6671 2.3521 12.45 2.3521 12.778H3.5396ZM3.57725 7.52051C3.24932 7.52051 2.9835 7.78634 2.9835 8.11424C2.9835 8.44215 3.24932 8.70799 3.57725 8.70799V7.52051ZM14.9454 8.70799C15.2733 8.70799 15.5392 8.44215 15.5392 8.11424C15.5392 7.78634 15.2733 7.52051 14.9454 7.52051V8.70799ZM14.2764 12.9632C14.2764 12.6353 14.0105 12.6671 13.6826 12.6671C13.3547 12.6671 13.0889 12.6353 13.0889 12.9632H14.2764ZM13.6826 14.0027L14.2753 14.0396C14.276 14.0273 14.2764 14.015 14.2764 14.0027H13.6826ZM15.5775 14.0027H14.9838C14.9838 14.015 14.9842 14.0273 14.985 14.0396L15.5775 14.0027ZM16.1713 12.778C16.1713 12.45 15.9055 12.5955 15.5775 12.5955C15.2496 12.5955 14.9838 12.45 14.9838 12.778H16.1713ZM4.63008 10.0942C4.30216 10.0942 4.03633 10.36 4.03633 10.688C4.03633 11.0159 4.30216 11.2817 4.63008 11.2817V10.0942ZM5.40196 11.2817C5.72987 11.2817 5.99571 11.0159 5.99571 10.688C5.99571 10.36 5.72987 10.0942 5.40196 10.0942V11.2817ZM13.1207 10.0942C12.7928 10.0942 12.5269 10.36 12.5269 10.688C12.5269 11.0159 12.7928 11.2817 13.1207 11.2817V10.0942ZM13.8926 11.2817C14.2205 11.2817 14.4863 11.0159 14.4863 10.688C14.4863 10.36 14.2205 10.0942 13.8926 10.0942V11.2817ZM4.24705 12.964V14.0035H5.43455V12.964H4.24705ZM4.24734 14.022C4.25491 14.2643 4.07251 14.4417 3.87219 14.4488L3.91369 15.6356C4.79566 15.6047 5.46137 14.8528 5.43427 13.9849L4.24734 14.022ZM3.91416 14.4488C3.71382 14.4416 3.53153 14.264 3.53929 14.0217L2.3524 13.9837C2.3246 14.8515 2.98976 15.604 3.87172 15.6355L3.91416 14.4488ZM3.5396 14.0027V12.778H2.3521V14.0027H3.5396ZM3.57725 8.70799H14.9454V7.52051H3.57725V8.70799ZM13.0889 12.9632V14.0027H14.2764V12.9632H13.0889ZM13.0901 13.9658C13.0543 14.5408 13.3324 15.0958 13.8246 15.4018L14.4515 14.3932C14.3388 14.3232 14.2659 14.1886 14.2753 14.0396L13.0901 13.9658ZM13.8246 15.4018C14.319 15.709 14.9412 15.709 15.4356 15.4018L14.8088 14.3932C14.6982 14.4619 14.562 14.4619 14.4515 14.3932L13.8246 15.4018ZM15.4356 15.4018C15.9279 15.0958 16.206 14.5408 16.1702 13.9658L14.985 14.0396C14.9943 14.1886 14.9214 14.3232 14.8088 14.3932L15.4356 15.4018ZM16.1713 14.0027V12.778H14.9838V14.0027H16.1713ZM4.63008 11.2817H5.40196V10.0942H4.63008V11.2817ZM13.1207 11.2817H13.8926V10.0942H13.1207V11.2817Z"
                                                fill="#F1F1F1"/>
                                        </svg> : <svg xmlns="http://www.w3.org/2000/svg" width="19" height="19"
                                                      viewBox="0 0 19 19" fill="none">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                  d="M10.2918 4.74967C11.1663 4.74967 11.8751 4.04079 11.8751 3.16634C11.8751 2.29189 11.1663 1.58301 10.2918 1.58301C9.41741 1.58301 8.70847 2.29189 8.70847 3.16634C8.70847 4.04079 9.41741 4.74967 10.2918 4.74967ZM8.75027 5.22908C9.01255 5.09794 9.32589 5.12253 9.5645 5.29297L10.3562 5.85845C10.608 6.03835 10.7319 6.34852 10.6734 6.65243L9.84309 10.9619L13.3256 16.1855C13.568 16.5493 13.4698 17.0409 13.1059 17.2834C12.7422 17.5259 12.2506 17.4276 12.0081 17.0638L8.34557 11.57L7.69998 10.6016C7.58697 10.4321 7.54366 10.2256 7.57907 10.0249L8.05131 7.34879L6.63798 8.05544L6.18529 10.3178C6.0995 10.7465 5.6824 11.0245 5.25367 10.9388C4.82494 10.8529 4.54694 10.4358 4.63273 10.0071L5.16139 7.36518C5.20931 7.12565 5.36514 6.92166 5.58362 6.81242L8.75027 5.22908ZM13.2081 10.2507L10.9325 9.49215L11.2346 7.92394L13.7089 8.74862C14.1236 8.88692 14.3478 9.33525 14.2095 9.75C14.0713 10.1648 13.623 10.389 13.2081 10.2507ZM4.85182 16.2365L7.43893 11.6373L7.68689 12.0092L8.42426 13.1151L6.23182 17.0128C6.01746 17.3939 5.53477 17.529 5.1537 17.3147C4.77262 17.1003 4.63747 16.6176 4.85182 16.2365Z"
                                                  fill="white"/>
                                        </svg>
                                    }
                                    50 минут
                                </div>
                            </div>
                        </article>
                    ))
                }
            </div>
            <div className="infrastructure__infrastructures-blocks-swiper">
                <Swiper
                    slidesPerView={'auto'}
                    spaceBetween={'20'}
                    className="mySwiper"
                >
                    {
                        articlesData.map((data, index) => (
                            <SwiperSlide key={data.name}>
                                <article className="infrastructures-block">
                                    <img src={`${data.imageSrc}`} alt=""/>
                                    <div className="infrastructures-block__info">
                                        <div>
                                            {data.name}
                                        </div>
                                        <div>
                                            {
                                                index !== 2 ? <svg xmlns="http://www.w3.org/2000/svg" width="19" height="19"
                                                                   viewBox="0 0 19 19"
                                                                   fill="none">
                                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                                          d="M4.16973 6.50242C4.7633 4.99667 5.47729 3.95801 7.09359 3.95801H11.4261C13.0409 3.95801 13.7557 4.99667 14.35 6.50242L14.9435 8.11347C15.3859 8.11893 15.7921 8.3645 16.011 8.75867C16.1398 8.98319 16.2073 9.23914 16.2063 9.49967V11.577C16.2121 12.0621 15.9733 12.5158 15.575 12.7772C15.3855 12.8982 15.1668 12.9623 14.9435 12.9624H3.57539C3.35218 12.9623 3.13346 12.8982 2.944 12.7772C2.54557 12.5158 2.30685 12.0621 2.3126 11.577V9.49967C2.31176 9.23945 2.37922 8.98375 2.50788 8.75947C2.72681 8.3653 3.13311 8.11972 3.57539 8.11426L4.16973 6.50242Z"
                                                          stroke="#F1F1F1" stroke-linecap="round" stroke-linejoin="round"/>
                                                    <path
                                                        d="M5.43455 12.964C5.43455 12.6361 5.16873 12.6671 4.8408 12.6671C4.51288 12.6671 4.24705 12.6361 4.24705 12.964H5.43455ZM4.8408 14.0035H4.24705C4.24705 14.0096 4.24715 14.0158 4.24734 14.022L4.8408 14.0035ZM3.89294 15.0421L3.87172 15.6355C3.88571 15.636 3.89971 15.636 3.91369 15.6356L3.89294 15.0421ZM2.94585 14.0027L3.53929 14.0217C3.5395 14.0153 3.5396 14.009 3.5396 14.0027H2.94585ZM3.5396 12.778C3.5396 12.45 3.09696 12.6671 2.76904 12.6671C2.44112 12.6671 2.3521 12.45 2.3521 12.778H3.5396ZM3.57725 7.52051C3.24932 7.52051 2.9835 7.78634 2.9835 8.11424C2.9835 8.44215 3.24932 8.70799 3.57725 8.70799V7.52051ZM14.9454 8.70799C15.2733 8.70799 15.5392 8.44215 15.5392 8.11424C15.5392 7.78634 15.2733 7.52051 14.9454 7.52051V8.70799ZM14.2764 12.9632C14.2764 12.6353 14.0105 12.6671 13.6826 12.6671C13.3547 12.6671 13.0889 12.6353 13.0889 12.9632H14.2764ZM13.6826 14.0027L14.2753 14.0396C14.276 14.0273 14.2764 14.015 14.2764 14.0027H13.6826ZM15.5775 14.0027H14.9838C14.9838 14.015 14.9842 14.0273 14.985 14.0396L15.5775 14.0027ZM16.1713 12.778C16.1713 12.45 15.9055 12.5955 15.5775 12.5955C15.2496 12.5955 14.9838 12.45 14.9838 12.778H16.1713ZM4.63008 10.0942C4.30216 10.0942 4.03633 10.36 4.03633 10.688C4.03633 11.0159 4.30216 11.2817 4.63008 11.2817V10.0942ZM5.40196 11.2817C5.72987 11.2817 5.99571 11.0159 5.99571 10.688C5.99571 10.36 5.72987 10.0942 5.40196 10.0942V11.2817ZM13.1207 10.0942C12.7928 10.0942 12.5269 10.36 12.5269 10.688C12.5269 11.0159 12.7928 11.2817 13.1207 11.2817V10.0942ZM13.8926 11.2817C14.2205 11.2817 14.4863 11.0159 14.4863 10.688C14.4863 10.36 14.2205 10.0942 13.8926 10.0942V11.2817ZM4.24705 12.964V14.0035H5.43455V12.964H4.24705ZM4.24734 14.022C4.25491 14.2643 4.07251 14.4417 3.87219 14.4488L3.91369 15.6356C4.79566 15.6047 5.46137 14.8528 5.43427 13.9849L4.24734 14.022ZM3.91416 14.4488C3.71382 14.4416 3.53153 14.264 3.53929 14.0217L2.3524 13.9837C2.3246 14.8515 2.98976 15.604 3.87172 15.6355L3.91416 14.4488ZM3.5396 14.0027V12.778H2.3521V14.0027H3.5396ZM3.57725 8.70799H14.9454V7.52051H3.57725V8.70799ZM13.0889 12.9632V14.0027H14.2764V12.9632H13.0889ZM13.0901 13.9658C13.0543 14.5408 13.3324 15.0958 13.8246 15.4018L14.4515 14.3932C14.3388 14.3232 14.2659 14.1886 14.2753 14.0396L13.0901 13.9658ZM13.8246 15.4018C14.319 15.709 14.9412 15.709 15.4356 15.4018L14.8088 14.3932C14.6982 14.4619 14.562 14.4619 14.4515 14.3932L13.8246 15.4018ZM15.4356 15.4018C15.9279 15.0958 16.206 14.5408 16.1702 13.9658L14.985 14.0396C14.9943 14.1886 14.9214 14.3232 14.8088 14.3932L15.4356 15.4018ZM16.1713 14.0027V12.778H14.9838V14.0027H16.1713ZM4.63008 11.2817H5.40196V10.0942H4.63008V11.2817ZM13.1207 11.2817H13.8926V10.0942H13.1207V11.2817Z"
                                                        fill="#F1F1F1"/>
                                                </svg> : <svg xmlns="http://www.w3.org/2000/svg" width="19" height="19"
                                                              viewBox="0 0 19 19" fill="none">
                                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                                          d="M10.2918 4.74967C11.1663 4.74967 11.8751 4.04079 11.8751 3.16634C11.8751 2.29189 11.1663 1.58301 10.2918 1.58301C9.41741 1.58301 8.70847 2.29189 8.70847 3.16634C8.70847 4.04079 9.41741 4.74967 10.2918 4.74967ZM8.75027 5.22908C9.01255 5.09794 9.32589 5.12253 9.5645 5.29297L10.3562 5.85845C10.608 6.03835 10.7319 6.34852 10.6734 6.65243L9.84309 10.9619L13.3256 16.1855C13.568 16.5493 13.4698 17.0409 13.1059 17.2834C12.7422 17.5259 12.2506 17.4276 12.0081 17.0638L8.34557 11.57L7.69998 10.6016C7.58697 10.4321 7.54366 10.2256 7.57907 10.0249L8.05131 7.34879L6.63798 8.05544L6.18529 10.3178C6.0995 10.7465 5.6824 11.0245 5.25367 10.9388C4.82494 10.8529 4.54694 10.4358 4.63273 10.0071L5.16139 7.36518C5.20931 7.12565 5.36514 6.92166 5.58362 6.81242L8.75027 5.22908ZM13.2081 10.2507L10.9325 9.49215L11.2346 7.92394L13.7089 8.74862C14.1236 8.88692 14.3478 9.33525 14.2095 9.75C14.0713 10.1648 13.623 10.389 13.2081 10.2507ZM4.85182 16.2365L7.43893 11.6373L7.68689 12.0092L8.42426 13.1151L6.23182 17.0128C6.01746 17.3939 5.53477 17.529 5.1537 17.3147C4.77262 17.1003 4.63747 16.6176 4.85182 16.2365Z"
                                                          fill="white"/>
                                                </svg>
                                            }
                                            15 минут
                                        </div>
                                    </div>
                                </article>
                            </SwiperSlide>
                        ))
                    }
                </Swiper>
            </div>
        </section>

        <section className="trim">
            <div className="trim__title">
                <h3>
                    Отделка
                </h3>
                <p>Отделка апартаментов выполнена с использованием высококачественных материалов: элегантные деревянные полы, современная керамика, стильные светильники и встроенная кухня с передовой техникой. В ванных комнатах установлены сантехника премиум-класса и красивая фурнитура. Всё это создаёт ощущение роскоши и комфорта.</p>
            </div>

            <div className="trim__slider">
                <Swiper
                    slidesPerView={'auto'}
                    spaceBetween={'20'}
                    className="mySwiper"
                >
                    <SwiperSlide>
                        <img src="/slider/slide1.png" alt=""/>
                    </SwiperSlide>
                    <SwiperSlide>
                        <img src="/slider/slide2.png" alt=""/>
                    </SwiperSlide>
                    <SwiperSlide>
                        <img src="/slider/slide3.png" alt=""/>
                    </SwiperSlide>
                </Swiper>
            </div>
        </section>

        <section className="meetingLanPage">
            <div className="container">
                <div className="meetingLanPage__content">
                    <ul className="meetingLanPage__content-list">
                        <li className="meetingLanPage__content-item">
                            <img src="/woman.png" alt="Image person" className="meetingLanPage__content-img"/>
                        </li>
                        <li className="meetingLanPage__content-item">
                            <div className="meetingLanPage__content-form">
                                <div className="meetingLanPage__content-info-logo">
                                    <div className="logo-svg">
                                        <img src="/zoom.svg" alt="Zoom img" width='151px' height='50px'
                                             className="meetingLanPage__content-zoom"/>
                                        <p className="meetingLanPage__content-descr">Запланируйте онлайн показ Villa
                                            Zafiro с нашим агентом</p>
                                    </div>
                                    <div className="img-text">
                                        <img src="/woman-ava-2.png" alt="Zoom img" width='151px' height='50px'
                                             className="meetingLanPage__content-zoom"/>

                                        <div>
                                            <img src="/zoom-2.svg" alt="Zoom img" width='151px' height='50px'
                                                 className="meetingLanPage__content-zoom"/>
                                            <p className="meetingLanPage__content-descr">Запланируйте онлайн показ Villa
                                                Zafiro с нашим агентом</p>
                                        </div>
                                    </div>
                                </div>

                                <div className="meetingLanPage__content-info">
                                    <div className="meetingLanPage__content-inputs">
                                        <input type="text" name="name" className="meetingLanPage__content-input"
                                               placeholder='Ваше имя'/>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="23" height="24"
                                             viewBox="0 0 23 24" fill="none">
                                            <path
                                                d="M19.3204 21.5898H4.59375V19.6719C4.59375 18.4001 5.07861 17.1805 5.94167 16.2814C6.80473 15.3821 7.97529 14.8769 9.19583 14.8769H14.7183C15.9389 14.8769 17.1095 15.3821 17.9725 16.2814C18.8355 17.1805 19.3204 18.4001 19.3204 19.6719V21.5898ZM11.9571 12.959C11.2319 12.959 10.5138 12.8101 9.84372 12.521C9.1737 12.2318 8.5649 11.808 8.05209 11.2737C7.53928 10.7394 7.13249 10.1051 6.85496 9.40699C6.57742 8.7089 6.43458 7.96068 6.43458 7.20507C6.43458 6.44946 6.57742 5.70124 6.85496 5.00315C7.13249 4.30506 7.53928 3.67075 8.05209 3.13645C8.5649 2.60215 9.1737 2.17832 9.84372 1.88916C10.5138 1.6 11.2319 1.45117 11.9571 1.45117C13.4217 1.45117 14.8264 2.05738 15.862 3.13645C16.8978 4.21552 17.4796 5.67904 17.4796 7.20507C17.4796 8.7311 16.8978 10.1946 15.862 11.2737C14.8264 12.3528 13.4217 12.959 11.9571 12.959Z"
                                                fill="white"/>
                                        </svg>
                                    </div>
                                    <div className="meetingLanPage__content-inputs">
                                        <input type="text" name="name" className="meetingLanPage__content-input"
                                               placeholder='Номер телефона'/>
                                        <svg xmlns="http://www.w3.org/2000/svg" width="23" height="24"
                                             viewBox="0 0 23 24" fill="none">
                                            <path
                                                d="M20.2394 16.2387V19.6297C20.2395 19.8725 20.1512 20.1063 19.9923 20.2839C19.8335 20.4615 19.6159 20.5698 19.3834 20.5867C18.9812 20.6155 18.6526 20.6308 18.3985 20.6308C10.2648 20.6308 3.67188 13.7616 3.67188 5.28711C3.67188 5.02243 3.68568 4.68007 3.71421 4.261C3.73052 4.01879 3.8344 3.79206 4.00488 3.62654C4.17537 3.46102 4.39976 3.36904 4.63279 3.36914H7.88738C8.00155 3.36902 8.11169 3.41312 8.19639 3.49287C8.2811 3.57262 8.33434 3.68233 8.34575 3.80068C8.36692 4.02125 8.38625 4.19674 8.40466 4.33004C8.58757 5.66008 8.96243 6.95366 9.51652 8.16693C9.60396 8.35873 9.5469 8.58793 9.38122 8.71068L7.39496 10.1894C8.6094 13.1378 10.8645 15.4873 13.6943 16.7527L15.1117 14.6871C15.1696 14.6027 15.2542 14.5422 15.3506 14.5161C15.447 14.4899 15.5491 14.4999 15.6391 14.5442C16.8035 15.1204 18.0447 15.51 19.3208 15.6997C19.4487 15.7189 19.6172 15.74 19.827 15.7611C19.9404 15.7732 20.0455 15.8288 20.1219 15.9171C20.1982 16.0053 20.2396 16.1199 20.2394 16.2387Z"
                                                fill="white"/>
                                        </svg>
                                    </div>
                                    <button className="meetingLanPage__content-btn">
                                    Выберите время
                                        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24"
                                             viewBox="0 0 24 24" fill="none">
                                            <path
                                                d="M10.0046 15.1715L19.1966 5.97852L20.6116 7.39252L10.0046 17.9995L3.64062 11.6355L5.05463 10.2215L10.0046 15.1715Z"
                                                fill="white"/>
                                        </svg>
                                    </button>
                                </div>
                            </div>
                        </li>
                    </ul>
                </div>
            </div>
        </section>

        <Area/>

        <Projects/>

        <Footer/>
    </>)
}

export default Home